src/Catalogs/кфкБрокеры/кфкБрокеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкБрокеры</name>
  <attributes>
    <name>БлокироватьПубликацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьЧтение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Узлы</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыПодключения</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РежимПароля</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/кфкБрокеры/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПараметрыПодключения = Неопределено Тогда
		ПараметрыПодключения = Новый ФиксированноеСоответствие(Новый Соответствие);
	КонецЕсли;
	
	СвойстваLibrdKafka = кфкИнтеграцияСлужебныйПовтИсп.СвойстваLibrdKafka("*");
	
	ЗаполнитьЗначенияПредставления();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПараметрыПодключения = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ТекущийОбъект.Ссылка,
		"ПараметрыПодключения"); // ФиксированноеСоответствие 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого Параметр Из ТекущийОбъект.ПараметрыПодключения Цикл
		Если Параметр.РежимПароля Тогда
			Параметр.Значение = "";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка, ПараметрыПодключения,
		"ПараметрыПодключения");
	
	ЗаполнитьЗначенияПредставления();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУзлы

&НаКлиенте
Процедура УзлыПриИзменении(Элемент)
	
	СброситьРезультатПроверкиПодключения();
	
	Элементы.ГруппаЖурналПроверкиПодключения.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УзлыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;

	НоваяСтрока = Объект.Узлы.Добавить();
	НоваяСтрока.Использование = Истина;
	Если Копирование И Не Элемент.ТекущиеДанные = Неопределено Тогда
		НоваяСтрока.Адрес = Элемент.ТекущиеДанные.Адрес;
	КонецЕсли;

	Элементы.Узлы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	Элементы.Узлы.ТекущийЭлемент = Элементы.УзлыАдрес;
	Элементы.Узлы.ИзменитьСтроку();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыПодключения

&НаКлиенте
Процедура ПараметрыПодключенияПриАктивизацииСтроки(Элемент)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
	Элементы.ПараметрыПодключенияРежимПароля.Доступность = Ложь;
	ТекущиеДанные = Элементы.ПараметрыПодключения.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Свойство = СвойстваLibrdKafka.Получить(ТекущиеДанные.Ключ); // см. кфкИнтеграцияСлужебный.НовоеОписаниеСвойстваLibrdKafka
		Если Свойство <> Неопределено И Свойство.ТипЗначения = "string" Тогда
			Элементы.ПараметрыПодключенияРежимПароля.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключенияПриИзменении(Элемент)
	
	Элементы.ГруппаЖурналПроверкиПодключения.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование,
		Родитель, ЭтоГруппа, Параметр);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключенияПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если Элемент.ТекущиеДанные = Неопределено Или ТекущиеДанные = Неопределено Или Не ТекущиеДанные.РежимПароля Тогда
		Возврат;
	КонецЕсли;
	
	Данные = Новый Соответствие(ПараметрыПодключения);
	Данные.Удалить(ТекущиеДанные.Ключ);
	ПараметрыПодключения = Новый ФиксированноеСоответствие(Данные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключенияКлючПриИзменении(Элемент)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияКлючПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключенияКлючНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияКлючНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора,
		ВыборДобавлением, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключенияКлючАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияКлючАвтоПодбор(ЭтотОбъект, Элемент, Текст, ДанныеВыбора,
		ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключенияЗначениеПредставлениеПриИзменении(Элемент)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияЗначениеПредставлениеПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПараметрыПодключенияЗначениеПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияЗначениеПредставлениеНачалоВыбора(ЭтотОбъект, Элемент,
		ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключенияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если Элемент.ТекущиеДанные = Неопределено Или ТекущиеДанные = Неопределено
		Или Элемент.ТекущийЭлемент <> Элементы.ПараметрыПодключенияЗначениеПредставление
		Или Не ТекущиеДанные.РежимПароля Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ЗначениеПредставление = ПараметрыПодключения.Получить(ТекущиеДанные.Ключ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключенияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если Элемент.ТекущиеДанные = Неопределено Или ТекущиеДанные = Неопределено
		Или Элемент.ТекущийЭлемент <> Элементы.ПараметрыПодключенияЗначениеПредставление
		Или Не ТекущиеДанные.РежимПароля Тогда
		Возврат;
	КонецЕсли;
	
	Данные = Новый Соответствие(ПараметрыПодключения);
	Данные.Вставить(ТекущиеДанные.Ключ, ТекущиеДанные.ЗначениеПредставление);
	ПараметрыПодключения = Новый ФиксированноеСоответствие(Данные);
	
	ТекущиеДанные.ЗначениеПредставление = "****************";
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключенияРежимПароляПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПараметрыПодключения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Данные = Новый Соответствие(ПараметрыПодключения);
	Если ТекущиеДанные.РежимПароля Тогда
		Данные.Вставить(ТекущиеДанные.Ключ, ТекущиеДанные.Значение);
		ТекущиеДанные.Значение = "****************";
		
	Иначе
		ТекущиеДанные.Значение = Данные.Получить(ТекущиеДанные.Ключ);
		Данные.Удалить(ТекущиеДанные.Ключ);
		
	КонецЕсли;
	ПараметрыПодключения = Новый ФиксированноеСоответствие(Данные);
	
	ТекущиеДанные.ЗначениеПредставление = ТекущиеДанные.Значение;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	ОтключитьОбработчикОжидания("СброситьРезультатПроверкиПодключения");
	
	СброситьРезультатПроверкиПодключения();
	Элементы.ГруппаЖурналПроверкиПодключения.Доступность = Ложь;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Проверка подключения к брокеру'");
	ДлительныеОперацииКлиент.ОжидатьЗавершение(НачатьПроверкуПодключенияКБрокеру(),
		Новый ОписаниеОповещения("ПроверитьПодключениеЗавершение", ЭтотОбъект), ПараметрыОжидания);
	
КонецПроцедуры

#Область Блокировка

&НаКлиенте
Процедура БлокироватьПубликацию(Команда)
	
	Модифицированность = Истина;
	
	Объект.БлокироватьПубликацию = Не Объект.БлокироватьПубликацию;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура БлокироватьЧтение(Команда)
	
	Модифицированность = Истина;
	
	Объект.БлокироватьЧтение = Не Объект.БлокироватьЧтение;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ФормаГруппаБлокировка.Доступность = Не Объект.Ссылка.Пустая();
	Элементы.ФормаБлокироватьПубликацию.Пометка = Объект.БлокироватьПубликацию;
	Элементы.ФормаБлокироватьЧтение.Пометка = Объект.БлокироватьЧтение;
	
	Элементы.ДекорацияБлокироватьЧтение.Видимость = Объект.БлокироватьЧтение;
	Элементы.ДекорацияБлокироватьПубликацию.Видимость = Объект.БлокироватьПубликацию;
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьРезультатПроверкиПодключения() Экспорт
	
	Для Каждого Узел Из Объект.Узлы Цикл
		Узел.Доступен = 0;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключениеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		Если Результат.Свойство("ИнформацияОбОшибке") И Результат.ИнформацияОбОшибке <> Неопределено Тогда
			СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
			
		ИначеЕсли Не ПустаяСтрока(Результат.ПодробноеПредставлениеОшибки) Тогда // TODO: ИнформацияОбОшибке с БСП 3.1.10
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
			
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось выполнить проверку подключения к брокеру.'"));
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	РезультатПроверки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Если РезультатПроверки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Статусы = РезультатПроверки.Статусы;
	Для Каждого Узел Из Объект.Узлы Цикл
		Узел.Доступен = ?(Статусы.Получить(Узел.Адрес) = Истина, 1, -1);
	КонецЦикла;
	Элементы.Узлы.Обновить();
	ПодключитьОбработчикОжидания("СброситьРезультатПроверкиПодключения", 10, Истина);
	
	ЖурналПроверкиПодключения = РезультатПроверки.ТекстЖурнала;
	Элементы.ГруппаЖурналПроверкиПодключения.Доступность = Истина;;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Использование=НЕТ -> НейтральноСерый
	ДобавитьУсловноеОформлениеУзла(WebЦвета.НейтральноСерый, Ложь, Неопределено);
	
	// Использование=ДА&Доступен=-1 -> Красный
	ДобавитьУсловноеОформлениеУзла(WebЦвета.Красный, Истина, -1);
	
	// Использование=ДА&Доступен=0 -> ЦветТекстаФормы
	ДобавитьУсловноеОформлениеУзла(ЦветаСтиля.ЦветТекстаФормы, Истина, 0);
	
	// Использование=ДА&Доступен=1 -> Зеленый
	ДобавитьУсловноеОформлениеУзла(WebЦвета.Зеленый, Истина, 1);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеУзла(Цвет, Использование, Доступен = Неопределено)
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	// Оформление
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Цвет);
	
	// Поля
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.Узлы.Имя);
	
	// Отбор:Использование
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Узлы.Использование");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Использование;
	
	// Отбор:Доступен
	Если Не Доступен = Неопределено Тогда
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Узлы.Доступен");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Доступен;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияПредставления()
	
	Для Каждого Строка Из Объект.ПараметрыПодключения Цикл // ТекущийОбъект
		
		Если Строка.РежимПароля Тогда
			Строка.Значение = "****************";
		КонецЕсли;
		
		Свойство = СвойстваLibrdKafka.Получить(Строка.Ключ); // см. кфкИнтеграцияСлужебный.НовоеОписаниеСвойстваLibrdKafka
		ТипЗначения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Свойство, "ТипЗначения");
		Строка.ЗначениеПредставление = ?(ТипЗначения = "int" Или ТипЗначения = "float",
			СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Строка.Значение), Строка.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НачатьПроверкуПодключенияКБрокеру()
	
	Свойства = Новый Соответствие; // Соответствие Из Строка
	Для Каждого Параметр Из Объект.ПараметрыПодключения Цикл
		Свойства.Вставить(Параметр.Ключ, ?(Параметр.РежимПароля,
			ПараметрыПодключения.Получить(Параметр.Ключ), Параметр.Значение));
	КонецЦикла;
	
	Узлы = Новый Массив; // Массив Из Строка
	Для Каждого Узел Из Объект.Узлы Цикл
		Если Узел.Использование Тогда
			Узлы.Добавить(Узел.Адрес);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверка подключения к брокеру'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"кфкИнтеграцияСлужебный.ПроверитьПодключениеКБрокеруВФоне", Узлы, Свойства);
	
КонецФункции

#КонецОбласти
